app/controllers/messages_controller.rb

  def index
    message = Message.order('Random()').first
---
SELECT "messages".* FROM "messages" ORDER BY Random() LIMIT $1  [["LIMIT", 1]]